To confirm, Security Groups must be `PATCH`ed into existence from a normal group. Otherwise this error is returned:

> Error 400: Cannot create a security group directly

I attempted to describe the change to Terraform, which sees it as requiring replacement:

```
  # module.asdf.google_cloud_identity_group.self must be replaced
-/+ resource "google_cloud_identity_group" "self" {
      ~ create_time  = "2021-02-24T16:21:37.499934Z" -> (known after apply)
      ~ id           = "groups/asdfasdf" -> (known after apply)
      ~ labels       = { # forces replacement
          + "cloudidentity.googleapis.com/groups.security"         = ""
            # (1 unchanged element hidden)
        }
      ~ name         = "groups/asdfasdf" -> (known after apply)
      ~ update_time  = "2021-02-24T16:21:37.499934Z" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ group_key {
            id = "asdf@asdf.com"
        }
    }
```

So, if this provider learns how to PATCH group labels then that would be enough for basic support. However it would require two `terraform apply` passes as stated above. Addressing this would likely require adding some special casing 😄 